{
    "stories": [{
            "name": "Jubin",
            "email": "jubins@smartdatainc.net",
            "phone": "9876543210",
            "heading": "Chasing the Lights – by Mark Powell",
            "shortDesc": "A crisp March evening, 1985. I’m five years old, blanket-wrapped and saucer-eyed, tracking skyward line of my dad’s outstretched finger across the pin-pricked vastness of infinity. He joins the dots through Orion’s rakish belt and then, losing the thread, begins to recount a teenage camping trip on a bleak and blasted Scots highland peninsula.",
            "story": "<p><a href=\"http://therealstory.org/wp-content/uploads/2015/04/15058240655_8d15f4848e_o.jpg\"><img alt=\"15058240655_8d15f4848e_o\" src=\"http://therealstory.org/wp-content/uploads/2015/04/15058240655_8d15f4848e_o-1024x682.jpg\" style=\"height:auto; margin:5px 0px; width:555px\" /></a></p>\r\n\r\n<p><em>It&rsquo;s just a few days until Stuart Maconie headlines The&nbsp;Real Story Live!</em></p>\r\n\r\n<p>To get y&rsquo;all excited, here&rsquo;s a new essay by Mark Powell. Mark will be reading it, alongside <a href=\"http://therealstory.org/2014/03/14/skins-by-sarah-handyside/\" target=\"_blank\">Sarah Handyside</a>, <a href=\"http://therealstory.org/2014/09/05/mrs-raffety-by-danielle-peet/\" target=\"_blank\">Danielle Peet</a>,&nbsp;<em>and co-editors Nija Dalal and Kate Feld on April 22&nbsp;at 7:30pm at Gulliver&rsquo;s in Manchester. More info <a href=\"http://therealstory.org/2015/03/24/stuart-maconie-headlines-the-2nd-real-story-live/\" target=\"_blank\">here</a>.</em></p>\r\n\r\n<p>&mdash;&mdash;</p>\r\n\r\n<p>A crisp March evening, 1985.&nbsp;I&rsquo;m five years old, blanket-wrapped and saucer-eyed, tracking skyward line of my dad&rsquo;s outstretched finger across the pin-pricked vastness of infinity. He joins the dots through Orion&rsquo;s rakish belt and then, losing the thread, begins to recount a teenage camping trip on a bleak and blasted Scots highland peninsula. Waking in the small hours with a bladder full of cheap whisky, he says, he&rsquo;d clambered blearily over his tent buddy and weaselled his squinting head through the zipper, only to find himself lassoed by the colossal blazing halo of something called the Northern Lights, pulsing in a soup-thick ring around that frostbitten, heather- choked valley.</p>\r\n\r\n<p>It&rsquo;s the first I&rsquo;ve heard of such an apparition and I&rsquo;m immediately fascinated, but without a visual frame of reference, my imagination strains with its exotic heft. I picture something like a giant, spectral version of those cheap plastic disco balls from Argos. For me and these so-called Northern Lights, it&rsquo;s love at first sight.</p>\r\n\r\n<p>&ndash;</p>\r\n\r\n<p>A considerably crisper March evening, 2006. I&rsquo;m 26 years old, blanket-wrapped and saucer-eyed, vibrating on a wooden bench in the sleeper cabin of a diesel train raking northward from Helsinki. Above me, Andrzej snores off a pyrrhic victory over a bottle of something called&nbsp;Apple Flirt. Outside our tiny window, the thermometer reads a stern &ndash;14 and falling. We left the city behind over an hour ago, and suburbs have long since given way to scattered farms, then the occasional pine spinney, and now&hellip; nothing. Pale moonlight, glinting blueish and silent back across mile after mile of motionless, unbroken snow. The local time is 3.57pm.</p>\r\n\r\n<p>Morning arrives in a quick flurry of travel clich&eacute;s: a lurch and hiss as our plucky locomotive collapses at the last stop in the charted universe; a frantic scramble for trousers and ticket stubs; a bed-haired tumble to an empty platform. Rovaniemi is the de facto provincial capital of northern Lapland. It&rsquo;s by no means a rustic hamlet &ndash; but, at&nbsp;6am&nbsp;on Sunday&nbsp;morning in a soft late-winter blizzard, it&rsquo;s hardly a bustling metropolis either.</p>\r\n\r\n<p>Up a twisting hill road glazed in echoing permafrost, we slither along a fence-line to our guesthouse. Bags go on beds, socks go on radiators; we go for breakfast. Eventually finding a caf&eacute; both open and staffed &ndash; a rare combination &ndash; we order a rerun of the salty black bread and smoked cheese that had passed for last night&rsquo;s train rucksack dinner. It&rsquo;s remarkable, I think, how quickly we&rsquo;ve acclimatised to these alien delicacies. Or, less charitably, how few food words we&rsquo;ve learned in a week.</p>\r\n\r\n<p>Rovaniemi squats six miles south of the Arctic Circle. Our otherwise pedestrian jaunt through hip urban Scandinavia is ending with this histrionic flourish at my insistence. I&rsquo;m convinced that it pretty much guarantees us an Aurora encounter in the goosebumped, teeth-chattering flesh. A combination of heavy cold medicines and blinkered whimsy meant I&rsquo;d all but sleepwalked through our six previous days on the broad, neon-lit boulevards of Stockholm, Oslo and Helsinki: for me, the trip begins and ends here,&nbsp;tonight, dark and shivering and no doubt gazing victorious up at a purple-green firmament in full celestial&nbsp;cri de coeur.</p>\r\n\r\n<p>The caf&eacute; owner breaks into a warm smile when we tell him this. He throws a floury arm around my shoulder, and brightly informs us we&rsquo;re visiting at the arse-end of the cloudiest February on record &ndash;&nbsp;they haven&rsquo;t seen so much as a star for a fortnight, and this weekend isn&rsquo;t looking any brighter.</p>\r\n\r\n<p>Andrzej shrugs and stumps off to inquire about a pint at the town&rsquo;s most famous watering hole. He returns moments later with a leaflet that promises the renowned Rovaniemi ice bar is, both depressingly and confusingly, closed for winter. As if by way of compensation, it points out that we&rsquo;re less than 400ft from the world&rsquo;s most northerly McDonalds, open year-round.</p>\r\n\r\n<p>Abandoning my dream of a&nbsp;midnight&nbsp;husky hunt for the elusive and skittish Borealis, we limply cash out at a day trip to a reindeer farm.</p>\r\n\r\n<p>10am and we&rsquo;re 30 miles north. A local Soundgarden fan in a dented Passat had spirited us over the mystical Arctic boundary line. He pulls over at a suspiciously nondescript kerbside, and I grab a crestfallen snapshot on the vague circumference of what turns out to be an entirely conceptual circle.</p>\r\n\r\n<p>We finally arrive at a modern, UPVC-glazed farmhouse. The farmer glances at our improvised survivalist wardrobe &ndash; two Primark coats apiece, a medium worn under a large &ndash; and rolls his eyes, raiding a wicker basket for a brace of unfathomably fattening reindeer hide onesies. Waddling through the family kitchen to his back yard, he hands us each a short length of knotted rope as he gestures toward a fuzzy brown mass by the fence.</p>\r\n\r\n<p>The &lsquo;reindeer&rsquo; is an overturned water butt, slung with off-cuts of matted Axminster and crowned by a pair of wonky bolt-on antlers. Over the next hour, we heroically master the art of snaring and bridling our inanimate target, earning admission to the real paddock in much the same way, we&rsquo;ll convince friends back home, as the hardy Norsemen of yore.</p>\r\n\r\n<p>Our first encounter with any actual reindeer is dominated by the realisation that they aren&rsquo;t the same size as any other animal. With two dozen of them jostling around us, it&rsquo;s impossible not to notice that there&rsquo;s always been an empty seat at the table between &lsquo;deer&rsquo; and &lsquo;horse&rsquo;, and I feel stupid for never having clocked it in my 26 years. Also: reindeer, with their long lashes and rubbery suede muzzles, have easily the most expressive faces of any beast of burden. As I gingerly bridle my chosen steed while dancing around his murderous horns, he effortlessly conveys a wide array of quasi-human responses, ranging from sarcasm to impatience to genuine pity.</p>\r\n\r\n<p>Finally sledded up, we turn away from the farm and set off at a faltering trot through a snicket into boreal pine forest. This humble fence gap turns out to be Finland&rsquo;s answer to the Narnia wardrobe, and within minutes we&rsquo;re lost on the set of a cheesy fairytale. Crunching through clean powder, our sleds weave looping tracks through thickets of low-hanging boughs, the brilliant white ground dappled in soft gold and paw prints. The first watery sun of the month breaks more strongly through the canopy, and the air around us thickens into a fantasy cascade of glittering ice crystals. Our guide calls out that this is &lsquo;diamond dust&rsquo;, an almost exclusively Arctic phenomenon caused by sudden temperature inversion just above the snow pack.</p>\r\n\r\n<p>I slide down under my coarse hide blanket, and try not to think about words like moment, and memory, and &ndash;&nbsp;least of all &ndash; Facebook.</p>\r\n\r\n<p>We stop around lunchtime in a small clearing with a blackened firepit, where our guide bakes fat pancakes on a vast iron paddle suspended over glowing rocks. We perch on a felled log swigging granular coffee from battered enamel pans, frost thickening on our cuffs and bootlaces, while he tells local folk tales in his indigenous Suomi purr. After stuffing the reindeer with bags of emerald moss from a nearby shed, we tackle up and steer our little caravan through the tree-line, breaking out on to the vast, open ice rink of a frozen lake.</p>\r\n\r\n<p>A barked command, a flick of the reigns down the right flank, and our reindeer snap open like coiled springs, hell-for-leather towards the horizon while we cling on for grim death behind. If we&rsquo;d been struck by the animals&rsquo; anthropomorphic qualities back in the paddock, we now learn of one area in which reindeer are vastly superior to humans: not only can they sprint at 45mph, but they can do so while shitting violently, every few metres. I scream oaths against deciding to leave sunglasses at the guesthouse. My howls are inaudible against the scrape-clatter of wood, ice and hooves, and indecipherable through repeated mouthfuls of fresh turd sorbet.</p>\r\n\r\n<p>And then I&rsquo;m laughing, and it&rsquo;s one of those laughs I know I&rsquo;ll be able to pick up years later, whenever I can&rsquo;t see another one lying around.</p>\r\n\r\n<p>&ndash;</p>\r\n\r\n<p>That evening I text dad from the guesthouse, confessing that I hadn&rsquo;t managed to track down the Aurora, but that I had seen diamond dust and lassoed a barrel and picked reindeer poo out of my teeth.</p>\r\n\r\n<p>Like everywhere in Finland, phone reception and WiFi signals sing a crystal clear, unwavering note of reassurance. They&rsquo;re terrible where he lives in Sheffield though, so it&rsquo;s three hours before I hear back, by which time, I&rsquo;m midway through the highest-latitude Filet O&rsquo;Fish money can buy.</p>\r\n\r\n<p>The text comes in his standard formation, a telegraphed three-liner, signed off like always:</p>\r\n\r\n<p><em>&ldquo;Sounds good. Always wanted to see NLights too, Gramps used to tell me he saw them in Scotland.&nbsp;</em><em>Brush your teeth. Dad x&rdquo;</em></p>\r\n",
            "id": 1431940607641
        }, {
            "name": "Jubin",
            "email": "jubins@smartdatainc.net",
            "phone": "09890890890",
            "heading": "Stuart Maconie headlines the 2nd Real Story: LIVE!",
            "shortDesc": "Come hear five writers read thrilling stories from real life at Manchester’s live creative nonfiction night.",
            "story": "<p><a href=\"http://therealstory.org/wp-content/uploads/2015/03/stuart.jpg\"><img alt=\"stuart\" src=\"http://therealstory.org/wp-content/uploads/2015/03/stuart.jpg\" style=\"height:auto; margin:5px 0px; width:700px\" /></a></p>\r\n\r\n<p>Come hear five writers read thrilling stories from real life at Manchester&rsquo;s&nbsp;live creative nonfiction night.</p>\r\n\r\n<p>The headliner for our second event is Stuart Maconie &ndash; broadcaster, journalist, columnist and author.&nbsp;Also on the bill are writers Danielle Peet, Sarah Handyside and&nbsp;Mark Powell&nbsp;alongside Real Story co-hosts Kate Feld and Nija Dalal.</p>\r\n\r\n<p>Wednesday, April 22at 7:30pm &ndash; 10:00pm<br />\r\nGullivers Manchester<br />\r\n109 Oldham St., M4 1LW Manchester<br />\r\nFREE ENTRY</p>\r\n\r\n<p>The author of books including <em>Pies and Predjudice: In Search of the North</em> and <em>Adventures on the High Teas</em>, Maconie is one of the country&rsquo;s best selling travel writers. His work has been compared with Bill Bryson, Alan Bennett and John Peel and described by The Times as a &lsquo;National Treasure&rsquo;.</p>\r\n\r\n<p>He co-hosts the Radcliffe and Maconie Show on BBC Radio 6Music, hosts The Freak Zone on 6Music, and has written and presented extensively for television. He divides his time between Birmingham, Manchester and the Lake District.</p>\r\n",
            "id": 1431941833243
        }, {
            "name": "Kate Feld",
            "email": "Kate@Feld.com",
            "phone": "9876543210",
            "heading": "The Lump by Adam Farrer",
            "shortDesc": " To whet your appetite for our first reading event, here’s a new essay by Adam Farrer, ‘The Lump’. Adam will be reading it, alongside Laura Barton, Benjamin Judge and co-editors Nija Dalal and Kate Feld on January 20 at 7:30pm at Gulliver’s in Manchester.",
            "story": "<p><em><a href=\"http://therealstory.org/wp-content/uploads/2015/01/thelump.jpg\"><img alt=\"thelump\" src=\"http://therealstory.org/wp-content/uploads/2015/01/thelump-1024x682.jpg\" style=\"height:auto; margin:5px 0px; width:555px\" /></a></em></p>\r\n\r\n<p><em>&nbsp;To whet your appetite for our first reading event, here&rsquo;s a new essay by <strong>Adam Farrer</strong>, &lsquo;The Lump&rsquo;. Adam will be reading it, alongside Laura Barton, Benjamin Judge and co-editors Nija Dalal and Kate Feld on January 20 at 7:30pm at Gulliver&rsquo;s in Manchester. More info<a href=\"http://therealstory.org/2014/12/19/the-real-story-live/\"> here</a>. Image by Emma Farrer.</em></p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&mdash;&ndash;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>On the roof of my mouth there&rsquo;s a lump. A tiny, peaked thing, roughly the diameter of a popcorn kernel. It&rsquo;s been there since my teens, never really growing but periodically rising up angrily, itching and throbbing whenever I get a cold or eat acidic fruits. I lived with it for years but inevitably there came a point, some time in my mid-20&rsquo;s, when I began to think of it as evidence of brain cancer.</p>\r\n\r\n<p>I&rsquo;ve never smoked and there&rsquo;s no real history of cancer in my immediate family but I became convinced that there had to be a first and that the first was going to be me. So the lump stopped being a lump and became instead the tip of the iceberg. The extreme end of a cabbage-sized tumour that jostled for room alongside my brain. Explaining why I sometimes struggled with names or caught myself putting the iron in the fridge. No longer finding space in my skull, I&rsquo;d decided that it was burrowing down into my mouth on its way to advancing into the rest of my body.</p>\r\n\r\n<p>I arranged to see my doctor for some tests and he called me back in a couple of weeks later to discuss the results.</p>\r\n\r\n<p>&ldquo;Well, the good news is,&rdquo; he said, smiling up at me from the results of my oral swab. &ldquo;it&rsquo;s not herpes.&rdquo;</p>\r\n\r\n<p>He sensed my unease at the word.</p>\r\n\r\n<p>&ldquo;It&rsquo;s not cancer either.&rdquo; he added quickly. &ldquo;To be honest, I&rsquo;ve no idea what it is.&rdquo; He paused for a moment and chewed his tongue in thought. &ldquo;At best I&rsquo;d say it was a flaw where the two sides of your body don&rsquo;t quite match up.&rdquo; To illustrate this he raised his hands, lined them up then slid the left downwards slightly. &ldquo;See?&rdquo;</p>\r\n\r\n<p>I did see. At least the concept of something being misaligned, not how that could apply to my body. Was this a joke or an educated medical opinion? Faced with such a diagnosis I was left to reach my own conclusions and, having read an article about parasites living on humans, it wasn&rsquo;t long before I thought of myself as the host organism for the creature that surely lived inside the lump. Or rather, the pupae.</p>\r\n\r\n<p>Some mornings I would awake dehydrated to feel it pulsing gently, dry to the touch and formed into a tusk-like apex. I would lie there, trying to picture what kind of creature was swimming around inside it. Waiting to see if this would be the morning when I&rsquo;d hear the splintering crack as the pupae opened to reveal the thrashing head of a ravenous grub, bent on devouring my tongue. Maybe a set of slowly extending, wire-haired legs or a cloud of flies.</p>\r\n\r\n<p>These thoughts cost me my sleep and my sense of ease. They haunted my dreams. And when I was awake I couldn&rsquo;t leave the lump alone</p>\r\n\r\n<p>&ldquo;What are you doing?&rdquo; I&rsquo;d be asked when caught jabbing my thumb against the roof of my mouth.</p>\r\n\r\n<p>&ldquo;I&rsquo;ve gat thish lunf.&rdquo; I&rsquo;d reply, before removing my thumb and repeating myself. &ldquo;Sorry, I&rsquo;ve got this lump. On the roof of my mouth. I don&rsquo;t know what it is, just that it&rsquo;s not herpes.&rdquo;</p>\r\n\r\n<p>This never went down well. People didn&rsquo;t want to hear about mysterious lumps or that I&rsquo;d been tested for herpes. So eventually I started telling them that I was sucking my thumb, which was an ignominy that was easier to handle than the truth. But something had to be done about that truth. I knew that if I ignored the lump for much longer the fear of it would drive me to a psychiatrist.</p>\r\n\r\n<p>Before it could, relief came in the form of my testicles. A sharp pain between my legs sent me back to my doctor with a fresh array of wild concerns. This time it was cancer for sure. I&rsquo;d not been kicked between the legs since primary school so I could think of no other reason why they might be hurting. The ante had been upped. My head could go hang. These were my balls.</p>\r\n\r\n<p>There was no lump this time, just a persistent ache punctuated by jolting incidents of leg crossing pain. A pain that once more I ascribed to cancer. My doctor asked me to drop my trousers then knelt in front of me, kneading my testicles as if trying to fashion them into a thumb pot. He dryly quizzed me as he worked.</p>\r\n\r\n<p>&ldquo;Does that hurt?&rdquo;</p>\r\n\r\n<p>&ldquo;No.&rdquo;</p>\r\n\r\n<p>&ldquo;Does that hurt?&rdquo;</p>\r\n\r\n<p>&ldquo;A little.&rdquo;</p>\r\n\r\n<p>&ldquo;And that?&rdquo;</p>\r\n\r\n<p>&ldquo;Ow! Yes.&rdquo;</p>\r\n\r\n<p>He diagnosed it as epididymitis, an inflammation of the epididymis. The area of my testicles, he explained, where sperm is stored and matures. I considered this to be disgusting news. True, it wasn&rsquo;t cancer or a venereal disease but I now had to live with the notion that a part of my body acted in the same manner as a cheese ripening facility. He prescribed a course of antibiotics and advised me to drink plenty of water. In time the pain subsided and I was free to return to losing sleep over the notion that my mouth might suddenly flood with newly hatched spiders.</p>\r\n\r\n<p>A year or so later, the pain returned. Once again I was diagnosed with Epididymitis.</p>\r\n\r\n<p>&ldquo;It happens,&rdquo; my doctor said casually. &ldquo;If an area is affected by the scars of an infection then it&rsquo;s prone to re-infection.&rdquo;</p>\r\n\r\n<p>The scars of infection. My genitals bore the scars of infection. Not the type of scars that chicks dig. Not for me the dashing slash across the cheek but an ugly little thing, deep within my cheese ripening facility. But again, it was not cancer and I decided that any time that something is not cancer it&rsquo;s a good thing.</p>\r\n\r\n<p>When the pain returned for the third time, I could no longer be convinced that it wasn&rsquo;t cancer. At that point I was starting to see it in all things. A spot should not be picked at in case it transformed into a burrowing cyst. If my skin itched, it was alive with cancer cells. So again I visited my doctor. My usual GP was not available and a locum occupied his consulting room. A mousey woman in her early 50&rsquo;s wearing a small gold crucifix around her neck. I mentioned my problem and her eyes flicked down to my groin then back up to my face.</p>\r\n\r\n<p>&ldquo;Ah,&rdquo; she said apologetically, &ldquo;That&rsquo;s not really my area.&rdquo;</p>\r\n\r\n<p>She nervously fingered her crucifix like a bad actress overplaying her role in a Dracula movie. She was &lsquo;fearful villager No.3&rsquo;. My crotch, a vampire about to bear its fangs.</p>\r\n\r\n<p>&ldquo;I mean, I&rsquo;d be happy to have a look if you want but I&rsquo;d feel more comfortable if you saw a specialist.&rdquo;</p>\r\n\r\n<p>She was not happy to have a look, I thought indignantly as she rang through to the hospital to make me an emergency appointment. She was rejecting my balls. Giving me the brush off. She sensed that Satan sat behind my zipper and she wasn&rsquo;t going anywhere near it, happily or otherwise. I felt that if I&rsquo;d found the guts to bring my balls into the surgery, then she should find the guts to look at them. That was only fair.</p>\r\n\r\n<p>She scribbled some notes on a card and asked me to hand it in at the hospital. I read it as I left but the scrawl didn&rsquo;t state anything alarmist. No demand for immediate castration and a regime of chemotherapy. Regardless, when I arrived the hospital and was shown into a cubicle, I struggled to remain calm.</p>\r\n\r\n<p>My balls seemed to be throbbing. Pounding. They couldn&rsquo;t have been more demanding of my attention if they&rsquo;d been a wildly waving clown honking a bulb horn. The longer I waited, the bigger and more obvious they felt. It seemed as if every nurse who passed me could see them, expanding in my jeans like a gradually inflating bouncy castle.</p>\r\n\r\n<p>Eventually a small, portly man entered my cubicle, pulling the curtain around him as he moved. He had a beaked nose and wore tan Cuban heels that matched the tone of his tight, high-waisted trousers. He looked like a fat bird sitting in an egg cup. He also looked like my childhood ice cream man. But he introduced himself as a doctor and I took him at his word.</p>\r\n\r\n<p>&ldquo;If you can just lower your trousers and underwear.&rdquo; he said, snapping on a pair of latex gloves.</p>\r\n\r\n<p>I shuffled them down and he advanced on me, dropping to one knee as if in proposal. Where he should have been presenting a diamond ring, he cradled my balls. He prodded around for a minute or so then got to his feet.</p>\r\n\r\n<p>&ldquo;I&rsquo;m not too concerned,&rdquo; he said, peeling off his gloves. &ldquo;But I think you should come in for an ultrasound just to make sure.&rdquo;</p>\r\n\r\n<p>A few weeks later I was laying trouserless on a gurney in a hospital side room, my hands covering my balls. My deceitful balls. That had maintained a veneer of whistling innocence, allowing me to fret about my mouth when all the while they were conducting sinister business in my underwear.</p>\r\n\r\n<p>A bearded medical trainee meekly entered the room and asked if I would mind letting him have a trial run with the ultrasound probe before the consultant arrived.</p>\r\n\r\n<p>&ldquo;Yeah, no problem.&rdquo; I replied, scared but benignly complicit. It was a problem, of course. I didn&rsquo;t want a learner driver probing at my groin. I didn&rsquo;t want to suffer the genital assessment equivalent of a forcefully mounted pavement or a kangarooing hill start. But he was gentle and cautious. It felt illicit but innocently so. Virginal and slightly clueless. He spoke gently as he worked.</p>\r\n\r\n<p>&ldquo;Is that okay?&rdquo; he said as he scanned the area. &ldquo;I&rsquo;m not hurting you am I? Just tell me if I am.&rdquo;</p>\r\n\r\n<p>I should have lost my virginity in this way, I thought. Careful. Considered. Not rushed.</p>\r\n\r\n<p>I relaxed and watched the monitor, looking out for the barbed tumour that I was certain had consumed and replaced my left gonad. The image swirled, my tissues forming patterns in the blackness. These were the ghosts of my testicles. Not the terrifying HD content I had imagined.</p>\r\n\r\n<p>A sudden clattering noise caused the trainee to start and the image disappeared. The consultant had arrived, bullishly making his way through the door and immediately talking loudly and quickly.</p>\r\n\r\n<p>&ldquo;Hello, hello, hello.&rdquo; he said. I was immediately struck by how much he looked like Super Mario. The trainee also seemed taken aback, his face reddening as if he&rsquo;d been caught doing something that he ought not.</p>\r\n\r\n<p>&ldquo;So, what have we got?&rdquo; the consultant said, clapping his hands and rubbing them together as he sized up my crotch. They made a noise like sandpaper. I felt my genitals recoil as if a string had been tugged at the base of my spine.</p>\r\n\r\n<p>I detailed my pains and the consultant grunted. He seemed to consider my situation but I could tell that he thought I was wasting his time. His was the demeanour of a fireman who had raced to tackle the great fire with which he could make his name only to discover a child with his head stuck between some railings.</p>\r\n\r\n<p>&ldquo;Okay,&rdquo; he said to the trainee, a note&nbsp;of weary resignation in his voice. &ldquo;Show me what you&rsquo;ve been doing.&rdquo;</p>\r\n\r\n<p>The trainee retraced his steps and the consultant frowned.</p>\r\n\r\n<p>&ldquo;No, no. You need to be firmer,&rdquo; he said, taking the probe from the trainee&rsquo;s hand. &ldquo;Here.&rdquo;</p>\r\n\r\n<p>He picked up my penis and yanked it to one side. Out of the way.</p>\r\n\r\n<p>&ldquo;Hold that, please.&rdquo; he said to me briskly. To my ears this was the&nbsp; same &lsquo;that&rsquo; people use when referring to an object of disgust. Like a mysterious puddle of goo on the floor or a particularly repellent bug. Shamed and cowed, I obeyed., watching as he greased up the probe, adjusted the settings and began to crush it into my testicles, navigating every inch.</p>\r\n\r\n<p>There was no doubt that this was effective. The screen suddenly showed a detailed image of one of my testicles, lurching out of the inky darkness like a deep sea fish. I was fascinated. I had seen an ultrasound before when my wife was pregnant with our daughter but at that point I wasn&rsquo;t hoping to see defects. I was looking for a regularly beating heart and a head that wasn&rsquo;t shaped like an anvil. But this time I was looking for a cause. A terrifying, spiked tumour gnashing at my balls.</p>\r\n\r\n<p>&ldquo;No, there&rsquo;s nothing there.&rdquo; he said. I chose not to see this as another slight. &ldquo;Perhaps a little calcification,&rdquo; he continued. He pointed to the monitor. &ldquo;There look.&rdquo;</p>\r\n\r\n<p>And there it was. The smoking gun. It didn&rsquo;t look like much. Just a few tiny white speckles. But to me it represented a justification for all this. The confirmation that this wasn&rsquo;t all in my head. That there was something real down there. I pictured this calcification magnified as dozens of tiny teeth crimping my epididymis as they nibbled their way along it. And I was good with that. I left the hospital content. Not happy about it but no longer living in dread.</p>\r\n\r\n<p>Years later I still think of them when I get the occasional twinge down there. These glitter-sized molars gnawing away. But they&rsquo;re okay. They&rsquo;re not cancer. They&rsquo;re not going to kill me. And they&rsquo;re a welcome distraction from the pain in my mouth and the fear that one day my wife will wake to find that my head has been sucked dry by a giant, pulsing tick that lays bloated and satisfied on my chest. The parasite that had been so patient and had finally got what it always wanted.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&mdash;</p>\r\n\r\n<p><em><a href=\"https://twitter.com/InsidePrestwich\"><strong>Adam Farrer</strong></a> works in IT by day. By night (and early in the morning) he writes true stories. He&rsquo;s written music reviews for various sites and struggled with a crime novel for some years. He&rsquo;s been publishing his stories at <a href=\"http://theunsmokedpipe.wordpress.com/\" target=\"_blank\">The Unsmoked Pipe</a> since October 2013. His hero is PG Wodehouse. You can read his previous piece for The Real Story, &lsquo;A Kodak Moment&rsquo;, <a href=\"http://therealstory.org/2014/03/04/a-kodak-moment-by-adam-farrer/\">here</a>.</em></p>\r\n",
            "id": 1431942252377
        }, {
            "name": "Nija Dalal",
            "email": "Nija@Dalal.com",
            "phone": "546546546546",
            "heading": "The Real Story: LIVE!",
            "shortDesc": "Come hear five writers read thrilling stories from real life at Manchester’s first live creative nonfiction night. Our headliner is Guardian writer and novelist Laura Barton. Also on the bill are writers Benjamin Judge and Adam Farrar alongside Real Story co-hosts Kate Feld and Nija Dalal.",
            "story": "<p><img alt=\"Picture of Laura Barton\" src=\"http://therealstory.org/wp-content/uploads/2014/12/meheadshot-225x300.jpg\" style=\"height:auto; margin:5px auto; width:225px\" /></p>\r\n\r\n<p>Come hear five writers read thrilling stories from real life at Manchester&rsquo;s first live creative nonfiction night. Our headliner is Guardian writer and novelist Laura Barton. Also on the bill are writers Benjamin Judge and Adam Farrar alongside Real Story co-hosts Kate Feld and Nija Dalal.</p>\r\n\r\n<p>Tuesday 20 January 2015, 7:30pm, Gullivers, Oldham Street, Manchester. Free.</p>\r\n\r\n<p>Laura Barton is a writer and broadcaster. She was a staff feature writer and music columnist for the Guardian for 10 years. Today she writes for the Guardian and the Observer, Intelligent Life, Q magazine and the New York Times among others, and much of her writing is concerned with music. Her first novel, Twenty-One Locks, was published in 2010 and was awarded a Betty Trask prize. She is a regular contributor to Radio 4, writing and presenting documentaries and short stories. She is currently working on a second novel, wildly different from the first, and a non-fiction book about music and sadness.</p>\r\n",
            "id": 1431942337399
        }, {
            "name": "Jubin Savla",
            "email": "jubins@smartdatainc.net",
            "phone": "45353454343",
            "heading": "A Kodak Moment, by Adam Farrer",
            "shortDesc": "I already knew how my brother’s body had looked when it was found; my mother had described the police photographs to me. He was slumped back in the dirt, one arm loosely draped behind his head. An eye lazily open. And now, a week later, I am looking at where he was found. A raised flower bed pressed up against the wall of a public toilet on the promenade of an East Yorkshire coastal town. I laid my mental image of him over it, imagining his body slowly expiring in the cold earth.",
            "story": "<p><a href=\"http://therealstory.org/wp-content/uploads/2014/03/4898869288_4f384d145c_o.jpg\"><img alt=\"OLYMPUS DIGITAL CAMERA\" src=\"http://therealstory.org/wp-content/uploads/2014/03/4898869288_4f384d145c_o-300x225.jpg\" style=\"height:auto; margin:5px 0px; width:300px\" /></a></p>\r\n\r\n<p>This week, an original essay by <strong><a href=\"https://twitter.com/InsidePrestwich\" target=\"_blank\">Adam Farrer</a>. </strong>Image by Emma Farrer.</p>\r\n\r\n<p>&mdash;&ndash;</p>\r\n\r\n<p>I already knew how my brother&rsquo;s body had looked when it was found; my mother had described the police photographs to me. He was slumped back in the dirt, one arm loosely draped behind his head. An eye lazily open. And now, a week later, I am looking at where he was found. A raised flower bed pressed up against the wall of a public toilet on the promenade of an East Yorkshire coastal town. I laid my mental image of him over it, imagining his body slowly expiring in the cold earth.</p>\r\n\r\n<p>Robert&rsquo;s funeral was earlier that day and I escaped the gathering back at his house, where friends and family were sharing stories about the good times and ignoring the dark ones that had led us to this day. His widow was stumbling around the living room with a glazed look on her face, offering drinks and boasting &ldquo;I&rsquo;m on Valium. It really works!&rdquo; to anyone who questioned her disposition. She was an ill-advised ad campaign. I pictured her smiling goggle-eyed at the camera as black-clad mourners sobbed around her, a slogan spread beneath her two raised thumbs.</p>\r\n\r\n<p>&ldquo;Embarrassed by grief? Try Valium. It really works!&rdquo;</p>\r\n\r\n<p>But it wasn&rsquo;t enough to escape the house; the garden was also littered with the fallout of grieving. Everyone gathered to write messages to him and tie them to helium-filled balloons before releasing them into the sky. I wrote &ldquo;You idiot. I love you.&rdquo; then batted my balloon into the air. Maybe it would land in the path of a simpleton who needed to feel wanted.</p>\r\n\r\n<p>But I felt smothered, as I knew I would. My dad offered to show me where it all ended for Robert, so we took the short walk down to the seafront.</p>\r\n\r\n<p>&ldquo;He was there,&rdquo; he said, pointing to the flowerbed.&nbsp;He turned away to look out to sea.</p>\r\n\r\n<p>I hadn&rsquo;t cried that day, but I wanted to then. I wanted to kneel and sob and say a handful of words to the last place his body had known. To bury my hands in that soil. I limited myself to gently placing my hand on the lip of the bed and letting the soil glance the tips of my fingers.</p>\r\n\r\n<p>I straightened up and joined my father in facing the sea. A car slipped slowly into my field of vision. A woman leaned out of the passenger window with a camera pointed our way, clicking as she drifted past us. My cousin Emma.</p>\r\n\r\n<p>&ldquo;Jesus.&rdquo; I thought. &ldquo;This fucking family.&rdquo;</p>\r\n\r\n<p>*****</p>\r\n\r\n<p>I used to run a photo lab. People will take photos of pretty much anything. It goes without saying that much of this is sexual. Human beings have felt compelled to point lenses at each other&rsquo;s groins since the dawn of photography. But there&rsquo;s a lot you might not expect. Amongst the holidays and babies there were inflamed hemorrhoids, bloody injuries, drunk people sat in a soup of their own waste. It wasn&rsquo;t unusual to happen across photographs of the dead.</p>\r\n\r\n<p>Mostly, they featured elderly people, laid out on their deathbeds. Occasionally their families huddled around, all smiles for the last ever group photo with grandma or grandpa. Propped up on a pillow they took pride of place at the centre, their slack, lifeless features like haunted expressions drawn on sackcloth. Imagine the family flicking through their photo album in later years.</p>\r\n\r\n<p>&ldquo;Awww, do you remember this? It&rsquo;s grandma when she was dead but still warm.&rdquo;</p>\r\n\r\n<p>One sequence of photos particularly remained with me, of a dead black man laying in a bed and gradually turning purplish grey. Each new shot showed a different set of sobbing adults and confused toddlers paying their respects to his rotting body. The final images, of his empty bed, showed the yellowish imprint his body had left as the juices leaked out of him. I flinched remembering I&rsquo;d once purchased a second-hand bed.</p>\r\n\r\n<p>But the photos were varied. Once in a while I&rsquo;d see a corpse laying in the cold store of a slaughterhouse awaiting a Jamaican burial while the business of dismembering goats carried on in the background. Or an open casket displaying a body. Unreal looking, like a waxwork presented in a lacquered display case.</p>\r\n\r\n<p>It wasn&rsquo;t always old people. A British soldier on home leave once dropped off a disposable camera containing images of freshly dead Iraqis, their limbs spread impossibly across shell craters. The store manager said she&rsquo;d deal with it. Later she handed the soldier the photos, shaking his hand, thanking him for the good work he was doing. It was 2003.</p>\r\n\r\n<p>But none of these images endured quite like the one a young couple brought in: a photo of their stillborn baby girl dressed in white and laying in a quilted basket, her nostrils leaking blood onto her lace collar. They asked me to touch it up so they could enlarge it and mount it in a frame.</p>\r\n\r\n<p>&ldquo;If you can just clean the blood up,&rdquo; the man said. &ldquo;And all that.&rdquo; he added. With a waft of his hand, he indicated the bruised looking indentations at the top of his daughter&rsquo;s head. It was tiny and misshapen, oddly reminiscent of a discounted fig. Her miniature, wound-like nose was partially formed and pinched-looking. &ldquo;And if you can, y&rsquo;know,&rdquo; he struggled to find adequate words. He went with the basics. &ldquo;&hellip; make the nose?&rdquo;</p>\r\n\r\n<p>He spoke in a practical tone, listing off tasks for a handy man. His manner said &ldquo;Don&rsquo;t bother me with the details, I just want to know how much this is going to cost me.&rdquo; He did all the talking. His partner remained behind him, with a grey expression of shock, picking at her nails. Punishing them. As if they were responsible for all of this. She trailed after him he studied the selection of frames. &ldquo;These are nice aren&rsquo;t they?&rdquo; he said brightly, indicating an elaborate gold design and taking it down from the shelf. &ldquo;If we had that in the living room. D&rsquo;you think?&rdquo;</p>\r\n\r\n<p>She nodded briskly. It could have been acceptance or a nervous tick.</p>\r\n\r\n<p>&ldquo;Yeah,&rdquo; he said, holding the frame out in front of him and admiring it, apparently picturing the doctored photo of his daughter mounted within. &ldquo;Shall we have that one?&rdquo; he said. Not to her now, to himself. To the room. Not expecting an answer or getting one. &ldquo;Yeah, we&rsquo;ll have that one.&rdquo; Talking for talking&rsquo;s sake. Coping. Filling the space left by her nauseous silence and my awkward, respectful one.</p>\r\n\r\n<p>I was giving them time and distance. I didn&rsquo;t rush them. I understood that something tragic and complex was happening to them, but I was also unsettled. I stayed behind the counter, leaving them to it and waiting for it to be over. My boss, Mrs Stand, sidled up and whispered to me.</p>\r\n\r\n<p>&ldquo;Remember, it&rsquo;s 3 for 2 on frames.&rdquo;</p>\r\n\r\n<p>Mrs Stand was tough to look at. She wore her curled hair high, trussed up in a ball. The kind of style a child might draw, perched up on top of her head, constructed from angry circles. Her makeup seemed to have been applied with half a potato and the back of a careless hand. A piece of paper, pressed onto her face and pulled away, would effectively reveal a wanted poster of the clown in your childhood nightmares. She wasn&rsquo;t the kind of person whose advice I should take.</p>\r\n\r\n<p>&ldquo;Will do,&rdquo; I lied. She strode contentedly into the back office. The man returned to the counter and I pointedly sold him nothing that he hadn&rsquo;t asked for. Ben our Photoshop expert queasily cloned areas of unblemished skin and gradually rebuilt the baby&rsquo;s face over the next few hours. By the time he&rsquo;d finished, there was no drink in the world stiff enough to straighten him out.</p>\r\n\r\n<p>The couple came to collect the photo the next day and their daughter looked like a baby. No gore. No bruising. No puckered, drizzling nose. Just a sleeping baby. Not sleeping but dead; every parent&rsquo;s nightmare. Over time, I hoped, the image we&rsquo;d altered would replace the one in their heads and that eventually they would take it down and never look at it again. Perhaps when another, surviving baby arrived. But it&rsquo;s not easy to choose and doctor the images your brain keeps.</p>\r\n\r\n<p>I have dozens of photos of Robert looking happy. A broadly smiling teenager riding his motorbike past our house in the late 80&rsquo;s. Laughing at a party with a skewed paper crown on his head. Proudly holding one of his infant children up to the camera. The image that persists for me isn&rsquo;t one of them. It&rsquo;s the last time I visited him before he died. I hadn&rsquo;t seen him for over a year. I was as shocked by the change in him as an aged aunt at the rapid growth of a child. But the change in Robert wasn&rsquo;t growth. It was decay.</p>\r\n\r\n<p>He sat by his computer in a fug of marijuana fumes, looking like a man who had spent an hour extricating himself from an electric fence. His eyes were wide and raw, staring out from a pale, pillowy head. His hair stood wildly on end. Something crucial was missing from his face.</p>\r\n\r\n<p>&ldquo;What happened to your eyebrows?&rdquo; I said, talking to his forehead.</p>\r\n\r\n<p>He lifted his hand to the void where his eyebrows once were and absently rubbed the skin.</p>\r\n\r\n<p>&ldquo;Scratched &lsquo;em off,&rdquo; he said casually. He smiled. It aged him by twenty years.</p>\r\n\r\n<p>Like a bad wig, once you&rsquo;ve noticed that someone has no eyebrows, you can concentrate on nothing else. I said the first thing that occurred to me.</p>\r\n\r\n<p>&ldquo;I guess you could draw some on.&rdquo;</p>\r\n\r\n<p>He smiled weakly and playfully told me to fuck off and turned to peck at his keyboard. Part of me was disappointed. I expected more. Robert had always been a man of high emotion. He had lived and reacted big. And I had learnt from him.</p>\r\n\r\n<p>His examples showed me what to do and what not to do. They revealed the mysteries of the world. He taught me how much alcohol is too much. What a clitoris was and where. How to gut a fish with a saw-backed hunting knife and why I would never want to. I learnt about music, drugs, fear and pain. That I don&rsquo;t like horror films. That I like pro-wrestling. That farts are funny if you light them and funnier still when they set fire to your trousers. That older brothers&rsquo; bedrooms contain magazines featuring naked women that will flip a switch in your midsection that can never be turned off. He showed me what it was like to be held down and farted on. To be punched. To have an axe thrown at me twice during a camping trip that we never spoke of. How to swear. To shoot an air gun. To play &lsquo;Smoke on the Water&rsquo; on the guitar. And now, what it was it was like to love your brother harder than he knew and have him become a stranger.</p>\r\n\r\n<p>If I had I known he had already tried to kill himself a number of times, we might have had a more significant conversation. If I&rsquo;d been told of the night that he staggered into the sea trying to drown himself or of the time he overdosed and woke up saying &ldquo;Shit. I&rsquo;m still alive,&rdquo; I&rsquo;m sure I would have said more. I&rsquo;d have at least tried to find out what drove him to scratch off his eyebrows. Looking at his room, filthy and littered with toys and the sticky handprints of his many children, I guessed at stress. I made small talk about his dust-caked shelf of Iron Maiden collectibles. I drove back to Manchester, my job done. My brother successfully visited. A box ticked.</p>\r\n\r\n<p>*****</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Two men on their way home from the pub found his body the following March, on a freezing night. They thought he was a sleeping drunk. I imagine they were concerned that he&rsquo;d catch his death out there. He&rsquo;d already caught it some hours before, with a combination of over one hundred pain killers and antidepressants. I don&rsquo;t know if he&rsquo;d consumed them before he left home that night, if he&rsquo;d sat in that flowerbed and feasted on them in a frenzy or if he&rsquo;d fed them methodically into his mouth. It doesn&rsquo;t really matter how it happened. It ended here. Where I was now having my photograph taken by a cousin who doesn&rsquo;t understand boundaries.</p>\r\n\r\n<p>Emma always takes photographs at funerals. &ldquo;It&rsquo;s the only time we&rsquo;re all together,&rdquo; she says. This was the same logic that led her to jump into a car and tail me down to the seafront. To her, this was a family moment. She was right. It just wasn&rsquo;t a Kodak one.</p>\r\n\r\n<p>I never saw her photo of us. Her laptop was stolen. I can only imagine it. Perhaps as we stood by the flowerbed, suited and grave, we looked like councillors dissatisfied at the state of our civic blooms. I don&rsquo;t think it looked like what it was: a photo of my father and I standing beside my brother&rsquo;s ghost, perplexed and briefly distracted from a new and permanently disabling kind of pain.</p>\r\n\r\n<p>&mdash;</p>\r\n\r\n<p>Adam Farrer works in IT by day. By night (and early in the morning) he writes true stories. He&rsquo;s written music reviews for various sites and struggled with a crime novel for some years. He&rsquo;s been publishing his stories at <a href=\"http://theunsmokedpipe.wordpress.com/\" target=\"_blank\">The Unsmoked Pipe</a> since October 2013. His hero is PG Wodehouse.</p>\r\n",
            "id": 1431942392518
        }]
}